ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8bd9f000-83c9-4a48-8166-2691b6f02183">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af52df40-7e26-4d2b-83b8-3e7f8c8e97b8">
    <name>ЭлектронныеУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="98432b29-54a0-461b-8949-90d8b093d361">
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="280f7296-5e90-4427-8283-20b46e71e378">
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f416de4c-0e65-4c7a-ac1b-6006787f8f96">
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f9e83d06-ca35-4604-8a3b-7763e3d4f9e8">
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f05a8baa-f36f-47cf-b83c-fdc47a0c74e5">
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="951a5403-e1a4-4484-8fda-c18df8f291d3">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="898c017b-174f-4670-8146-5c6e75af51c1">
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="57507687-e857-4627-84a6-131b6dc5555a">
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/ЗаказПоставщику/ManagerModule.bsl
&Вместо("ПолучитьДанныеДляПечатнойФормыЗаказаНаТоварыУслуги")
Функция ПолучитьДанныеДляПечатнойФормыЗаказаНаТоварыУслуги1(МассивОбъектов, ПараметрыПечати, КодЯзыка) Экспорт
	
	Запрос = Новый Запрос();
	ТекстЗапроса =  
	"ВЫБРАТЬ
	|	Документы.ЖелаемаяДатаПоступления						КАК ЖелаемаяДатаПоступления,
	|	Документы.Ссылка										КАК Ссылка,
	|	Документы.Номер											КАК Номер,
	|	Документы.Дата											КАК Дата,
	|	Документы.Организация									КАК Организация,
	|	Документы.Организация									КАК Заказчик,
	|
	|	ВЫБОР КОГДА
	|		Документы.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|										ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭлектронныеУслуги))
	|	ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ													КАК УчитыватьНДС,
	|	Документы.ЦенаВключаетНДС								КАК ЦенаВключаетНДС,
	|	Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя) КАК ОперацияОблагаетсяНДСУПокупателя,
	|
	|	Документы.Организация.Префикс							КАК Префикс,
	|	Документы.Контрагент									КАК Контрагент,
	|	Документы.Контрагент									КАК Исполнитель,
	|	Документы.БанковскийСчет								КАК БанковскийСчет,
	|	Документы.БанковскийСчет.ТекстКорреспондента			КАК БанковскийСчетТекстКорреспондента,
	|	Документы.Валюта										КАК Валюта,
	|	Документы.Менеджер.ФизическоеЛицо						КАК Менеджер,
	|	Документы.ДополнительнаяИнформация						КАК ДополнительнаяИнформация,
	|
	|	ВЫБОР Документы.СпособДоставки
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада) ТОГДА
	|			Документы.АдресДоставкиДляПоставщика
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада) ТОГДА
	|			Документы.АдресДоставкиДляПоставщика
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи) ТОГДА
	|			Документы.АдресДоставкиПеревозчика
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ													КАК АдресДоставки,
	|
	|	НЕОПРЕДЕЛЕНО											КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО											КАК Грузополучатель,
	// Параметры для выбора областей макета отчета
	|	ЛОЖЬ													КАК ПоказыватьНДСВСтроках,
	|	ИСТИНА													КАК ИспользоватьАвтоСкидки,
	|	&Тип													КАК Тип,
	|	&ПредставлениеДокумента									КАК ПредставлениеДокумента,
	|	&ПредставлениеВОшибке									КАК ПредставлениеВОшибке
	|
	|ИЗ
	|	Документ.ЗаказПоставщику КАК Документы
	|
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ДатаПлатежа,
	|	НЕОПРЕДЕЛЕНО КАК ВариантОплаты,
	|	НЕОПРЕДЕЛЕНО КАК ПроцентПлатежа,
	|	НЕОПРЕДЕЛЕНО КАК СуммаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка											КАК Ссылка,
	|	Товары.НомерСтроки										КАК НомерСтроки,
	|	Товары.НоменклатураПартнера.Наименование				КАК НаименованиеНоменклатурыИсполнителя,
	|	Товары.НоменклатураПартнера.Код							КАК КодИсполнителя,
	|	Товары.НоменклатураПартнера.Артикул						КАК АртикулИсполнителя,
	|	Товары.ВидЦеныПоставщика								КАК ВидЦеныИсполнителя,
	|	Товары.Номенклатура										КАК Номенклатура,
	|	Товары.Номенклатура.Код									КАК Код,
	|	Товары.Номенклатура.Артикул								КАК Артикул,
	|	Товары.Номенклатура.НаименованиеПолное					КАК НаименованиеПолное,
	|	Товары.ДатаПоступления									КАК ДатаПоступления,
	|	Товары.Характеристика.НаименованиеПолное				КАК Характеристика,
	|	""""													КАК Содержание,
	|
	|	Товары.КоличествоУпаковок								КАК Количество,
	|
	|	Товары.Цена												КАК Цена,
	|	Товары.СуммаРучнойСкидки								КАК СуммаСкидки,
	|	Товары.Сумма + Товары.СуммаРучнойСкидки					КАК СуммаБезСкидки,
	|	Товары.Сумма											КАК Сумма,
	|	Товары.СтавкаНДС										КАК СтавкаНДС,
	|	Товары.СуммаНДС											КАК СуммаНДС,
	|
	|	ВЫБОР КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	|		ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения)
	|	ИНАЧЕ
	|		ПРЕДСТАВЛЕНИЕ(Товары.Упаковка)
	|	КОНЕЦ													КАК ЕдиницаИзмерения,
	|
	|	ВЫБОР КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1 ТОГДА
	|		НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ
	|		Товары.Упаковка.Наименование
	|	КОНЕЦ													КАК Упаковка,
	|
	|	ВЫБОР КОГДА Товары.Ссылка.ВернутьМногооборотнуюТару
	|			  И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ													КАК ЭтоВозвратнаяТара
	|
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК Товары
	|
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|	И Товары.Отменено = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"Товары.Упаковка",
		"Товары.Номенклатура"));
		
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("МассивОбъектов",			МассивОбъектов);
	Запрос.УстановитьПараметр("Тип",					ПараметрыПечати["Тип"]);
	Запрос.УстановитьПараметр("ПредставлениеДокумента",	НСтр("ru = 'Заказ поставщику';
																|en = 'Purchase order'"));
	Запрос.УстановитьПараметр("ПредставлениеВОшибке",	НСтр("ru = 'заказа поставщику';
																|en = 'purchase order'"));
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке",			ПакетРезультатовЗапроса[0]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты",	ПакетРезультатовЗапроса[1]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти",	ПакетРезультатовЗапроса[2]);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции
